
// Експортуємо функцію, що знаходить у кожному рядку мінімальний елемент
// і віднімає його від усіх елементів цього рядка
export function minimazeRows(c) {

  // Ітеруємося по рядкам
  for(let i = 0; i < c.length; ++i) {

    // Знаходимо мінімум рядка
    const m = Math.min(...c[i]);

    // Для кожного елементу у цьому стовпці віднімаємо мінімальний елемент
    for(let j = 0; j < c[i].length; ++j) {
      c[i][j] -= m;
    }
  }
}

// Аналогічно зі стовпцями
export function minimazeColumns(c) {

  // Ітеруємося по стовпцям
  for(let j = 0; j < c[0].length; ++j) {

    // Ініціалізумо змінну мінімального елементу нескінченністю 
    let m = Number.POSITIVE_INFINITY;

    // Ітеруємося по рядкам і знаходимо мінімум для цього стовпця
    for(let i = 0; i < c.length; ++i) {
      m = Math.min(m, c[i][j]);
    }

    // Віднімаємо мінімальний елемент від усіх елементів стовпця
    for(let i = 0; i < c.length; ++i) {
      c[i][j] -= m;
    }
  }
}